#include<stdio.h>
//จงเขียนโปรแกรมรับตัวเลข 1 ตัวแล้วให้คอมพิวเตอร์วาดรูปเครื่องหมาย * เป็นรูปผีเสื้อที่มีขนาดของปีกแต่ละข้างเท่ากับตัวเลขที่รับเข้ามา ดังตัวอย่าง (Level 3)

int main()
{
    int n,i=1;
    scanf("%d",&n);
    while(i<=(2*n)-1)
    {
        int j=1;
        while(j<=(2*n)-1)
        {
            if(i>=j&&i+j<=2*n||j>=i&&i+j>=2*n)
            {
                printf("*");
            }
            else printf(" ");
            j++;
        }
        printf("\n");
        i++;
    }
    return 0;
}